tap "charmbracelet/tap"
tap "danielgtaylor/restish"
tap "homebrew/bundle"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple testing library for bash scripts
brew "bashunit"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Tool for glamorous shell scripts
brew "gum"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Terminal multiplexer
brew "tmux"
# Execute commands when watched files change
brew "watchexec"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# AI on the command line
brew "charmbracelet/tap/mods"
# Restish is a CLI for interacting with REST-ish HTTP APIs with some nice features built-in.
brew "danielgtaylor/restish/restish"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dorzey.vscode-sqlfluff"
vscode "editorconfig.editorconfig"
vscode "karunamurti.haml"
vscode "manuelpuyol.erb-linter"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "shopify.ruby-lsp"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
