tap "browsh-org/browsh"
tap "charmbracelet/tap"
tap "danielgtaylor/restish"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "keidarcy/tap"
tap "rwx-cloud/tap"
tap "rwx-research/tap"
tap "sst/tap"
tap "thezoraiz/ascii-image-converter"
tap "valkyrie00/bbrew"
brew "act"
brew "argocd"
brew "awscli"
brew "bashunit"
brew "bat"
brew "bats-core"
brew "fontconfig"
brew "chafa"
brew "chawan"
brew "cheat"
brew "difftastic"
brew "docker-credential-helper-ecr"
brew "eget"
brew "exercism"
brew "eza"
brew "fastly"
brew "fd"
brew "gcc"
brew "fswatch"
brew "fx"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-who"
brew "gitlab-ci-local"
brew "glab"
brew "glow"
brew "graphviz"
brew "gum"
brew "helm"
brew "htmlq"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "ijq"
brew "imagemagick"
brew "isync"
brew "jless"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "mandown"
brew "minikube"
brew "mise"
brew "mongosh"
brew "msmtp"
brew "neomutt"
brew "neovim"
brew "neovide"
brew "oha"
brew "ripgrep"
brew "opencode"
brew "opentofu"
brew "pass"
brew "poppler"
brew "pup"
brew "restish"
brew "sevenzip"
brew "shellcheck"
brew "sqlfluff"
brew "terraform"
brew "tmux"
brew "tree-sitter-cli"
brew "universal-ctags"
brew "vhs"
brew "watchexec"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "browsh-org/browsh/browsh"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/mods"
brew "gromgit/brewtils/taproom"
brew "keidarcy/tap/e1s"
brew "rwx-research/tap/abq"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "docker.docker"
vscode "dorzey.vscode-sqlfluff"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "huanamigo.tokyo-night-ultra"
vscode "karunamurti.haml"
vscode "manuelpuyol.erb-linter"
vscode "marp-team.marp-vscode"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shopify.ruby-lsp"
vscode "sqlfluff.vscode-sqlfluff"
vscode "timonwong.shellcheck"
vscode "tonsky.theme-alabaster"
vscode "vscodevim.vim"
go "github.com/kisielk/errcheck"
go "cmd/go"
go "golang.org/x/tools/cmd/godoc"
go "cmd/gofmt"
go "github.com/gokatas/gokatas"
go "github.com/bitfield/gotestdox/cmd/gotestdox"
go "github.com/evilmartians/lefthook/v2"
go "golang.org/x/pkgsite/cmd/pkgsite"
cargo "himalaya"
flatpak "com.brave.Browser"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.hluk.copyq"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "io.ente.auth"
flatpak "md.obsidian.Obsidian"
flatpak "net.ankiweb.Anki"
flatpak "org.chromium.Chromium"
flatpak "org.flameshot.Flameshot"
flatpak "org.tigervnc.vncviewer"
