# Run your GitHub Actions locally
brew "act"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Diff that understands syntax
brew "difftastic"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Run gitlab pipelines locally as shell executor or docker executor
brew "gitlab-ci-local"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive jq
brew "ijq"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Command-line pager for JSON data
brew "jless"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Package manager for the Lua programming language
brew "luarocks"
# Man-page inspired Markdown viewer
brew "mandown"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Password manager
brew "pass"
# Parse HTML at the command-line
brew "pup"
# CLI tool for interacting with REST-ish HTTP APIs
brew "restish"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Your CLI home video recorder
brew "vhs"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# AI on the command line
brew "charmbracelet/tap/mods"
# vscode "anthropic.claude-code"
# vscode "asvetliakov.vscode-neovim"
# vscode "catppuccin.catppuccin-vsc"
# vscode "catppuccin.catppuccin-vsc-icons"
# vscode "connorshea.vscode-ruby-test-adapter"
# vscode "docker.docker"
# vscode "dorzey.vscode-sqlfluff"
# vscode "editorconfig.editorconfig"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "gitlab.gitlab-workflow"
# vscode "hashicorp.terraform"
# vscode "hbenl.vscode-test-explorer"
# vscode "huanamigo.tokyo-night-ultra"
# vscode "karunamurti.haml"
# vscode "manuelpuyol.erb-linter"
# vscode "marp-team.marp-vscode"
# vscode "mkhl.shfmt"
# vscode "ms-azuretools.vscode-containers"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.live-server"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.test-adapter-converter"
# vscode "redhat.vscode-yaml"
# vscode "ryanluker.vscode-coverage-gutters"
# vscode "shopify.ruby-lsp"
# vscode "sqlfluff.vscode-sqlfluff"
# vscode "timonwong.shellcheck"
# vscode "tonsky.theme-alabaster"
# vscode "vscodevim.vim"
flatpak "com.brave.Browser"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.hluk.copyq"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "io.ente.auth"
flatpak "md.obsidian.Obsidian"
flatpak "net.ankiweb.Anki"
flatpak "org.chromium.Chromium"
flatpak "org.flameshot.Flameshot"
flatpak "org.tigervnc.vncviewer"
